# Belajar pandas

## #01: Menyertakan prefix dan suffix pada kolom data frame

In [307]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.3
1.21.2

In [308]:
# Persiapan data frame
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10, size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  6  7  5  8  1
1  2  5  6  2  5
2  6  6  4  2  8
3  4  1  6  1  7
4  8  7  2  6  6

In [309]:
tuple('ABCDE')

('A', 'B', 'C', 'D', 'E')

In [310]:
# Menyertakan prefix kolom
df.add_prefix('kolom_')

   kolom_A  kolom_B  kolom_C  kolom_D  kolom_E
0        6        7        5        8        1
1        2        5        6        2        5
2        6        6        4        2        8
3        4        1        6        1        7
4        8        7        2        6        6

In [311]:
#Menyertakan sufix kolom
df.add_suffix('_field')

   A_field  B_field  C_field  D_field  E_field
0        6        7        5        8        1
1        2        5        6        2        5
2        6        6        4        2        8
3        4        1        6        1        7
4        8        7        2        6        6

## #02: Pemilihan baris (rows selection) pada data frame

In [312]:
# Persiapan data frame
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,5, size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  3  4  3  4  1
1  1  3  3  1  4
2  2  1  4  2  3
3  3  4  3  2  4
4  1  1  3  3  1
5  4  1  1  4  1
6  1  4  2  1  2
7  3  4  3  1  4
8  2  2  2  4  2
9  4  1  1  3  1

In [313]:
# Selection dengan operator logika | (or)
df[(df['A'] == 1) | (df['A'] == 3)]

   A  B  C  D  E
0  3  4  3  4  1
1  1  3  3  1  4
3  3  4  3  2  4
4  1  1  3  3  1
6  1  4  2  1  2
7  3  4  3  1  4

In [314]:
# Selection dengan fungsi isin()
df[df['A'].isin([1,3])]

   A  B  C  D  E
0  3  4  3  4  1
1  1  3  3  1  4
3  3  4  3  2  4
4  1  1  3  3  1
6  1  4  2  1  2
7  3  4  3  1  4

In [315]:
# Mengenal operator negasi ~
df[~df['A'].isin([1,3])]

   A  B  C  D  E
2  2  1  4  2  3
5  4  1  1  4  1
8  2  2  2  4  2
9  4  1  1  3  1

## #03: Konversi tipe data string ke numerik pada kolom data frame

In [316]:
# Persiapan data frame
data = {'col1':['1','2','3','teks'],
        'col2':['1','2','3','4']}

df=pd.DataFrame(data)
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [317]:
df.dtypes

col1    object
col2    object
dtype: object

In [318]:
# konversi tipe data dengan fungsi astype()
df_x = df.astype({'col2':'int64'})
df_x

   col1  col2
0     1     1
1     2     2
2     3     3
3  teks     4

In [319]:
df_x.dtypes

col1    object
col2     int64
dtype: object

In [320]:
# Konversi tipe data numerik dengan fungsi to_numeric()
df.apply(pd.to_numeric, errors ='coerce')

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4

## #04: Pemiliihan kolom (columns selection) pada pandas data frame berdasarkan tipe data

In [321]:
# Persiapan data frame
n_rows = 5
n_cols = 2
cols = ['bil_pecahan','bil_bulat']

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows, n_cols)), columns=cols)
df['bil_pecahan']=df['bil_pecahan'].astype('float')

df.index=pd.util.testing.makeDateIndex(n_rows, freq='H')
df=df.reset_index()

df['teks']=list('ABCDE')

df

                index  bil_pecahan  bil_bulat teks
0 2000-01-01 00:00:00         18.0          9    A
1 2000-01-01 01:00:00         12.0          2    B
2 2000-01-01 02:00:00          8.0          7    C
3 2000-01-01 03:00:00          2.0         14    D
4 2000-01-01 04:00:00         12.0         18    E

In [322]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

In [323]:
# memilih kolom bertipe data numerik
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0         18.0          9
1         12.0          2
2          8.0          7
3          2.0         14
4         12.0         18

In [324]:
df.select_dtypes(include='float')

   bil_pecahan
0         18.0
1         12.0
2          8.0
3          2.0
4         12.0

In [325]:
df.select_dtypes(include='int')

   bil_bulat
0          9
1          2
2          7
3         14
4         18

In [326]:
# Memilih kolom bertipe data string atau object
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

In [327]:
# Memilih kolom bertipe data datetime
df.select_dtypes(include='datetime')

                index
0 2000-01-01 00:00:00
1 2000-01-01 01:00:00
2 2000-01-01 02:00:00
3 2000-01-01 03:00:00
4 2000-01-01 04:00:00

In [328]:
# Memiliih kolom dengan kombinasi tipe data
df.select_dtypes(include=['number','object'])

   bil_pecahan  bil_bulat teks
0         18.0          9    A
1         12.0          2    B
2          8.0          7    C
3          2.0         14    D
4         12.0         18    E

## #05: Membalik urutan baris dan kolom pada data frame

In [329]:
# Persiapan data frame
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10,size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  8  7  8  4  2
1  8  2  6  7  9
2  1  6  7  5  7
3  3  2  1  7  6
4  9  5  8  4  3

In [330]:
# Membalik urutan kolom
df.loc[:, ::-1]

   E  D  C  B  A
0  2  4  8  7  8
1  9  7  6  2  8
2  7  5  7  6  1
3  6  7  1  2  3
4  3  4  8  5  9

In [331]:
# Membalik urutan baris
df.loc[::-1]

   A  B  C  D  E
4  9  5  8  4  3
3  3  2  1  7  6
2  1  6  7  5  7
1  8  2  6  7  9
0  8  7  8  4  2

In [332]:
# Membalik urutan baris dan melakukan penyesuaian ulang index
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  9  5  8  4  3
1  3  2  1  7  6
2  1  6  7  5  7
3  8  2  6  7  9
4  8  7  8  4  2

## #06: Mengganti nama (label0 kolom pada data frame

In [333]:
# Persiapan data frame
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10,size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  7  3  7  9  5
1  9  2  7  6  5
2  9  1  7  8  2
3  1  3  2  6  6
4  2  1  5  8  6

In [334]:
# Mengganti nama (label) untuk sebuah kolom pada data frame
df.rename(columns={'C' : 'Hobi'})

   A  B  Hobi  D  E
0  7  3     7  9  5
1  9  2     7  6  5
2  9  1     7  8  2
3  1  3     2  6  6
4  2  1     5  8  6

In [335]:
# Mengganti nama (label) untuk banyak kolom pada data frame
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  C  Kota  E
0     7       3  7     9  5
1     9       2  7     6  5
2     9       1  7     8  2
3     1       3  2     6  6
4     2       1  5     8  6

## #07: Menghapus missing values pada data frame (NaN)

In [336]:
# Persiapan data frame
df = pd.util.testing.makeMissingDataframe().reset_index() #formula untuk bikin dummy data dengan missing values
df.head()

        index         A         B         C         D
0  UafXORfsNo -1.507542 -0.007271 -0.866165  1.822973
1  XekafS6fTR -0.256574       NaN -0.084703 -0.265507
2  HdGZpUCGJU -1.287679  1.685643 -0.211617  0.496304
3  Kxu5UHgjKC       NaN  0.431297 -0.323424 -1.634375
4  SDeZJuTqgv  0.370362 -1.297056  1.569066 -0.067658

In [337]:
df = df.rename(columns={'index' : 'Z'})
df.head()

            Z         A         B         C         D
0  UafXORfsNo -1.507542 -0.007271 -0.866165  1.822973
1  XekafS6fTR -0.256574       NaN -0.084703 -0.265507
2  HdGZpUCGJU -1.287679  1.685643 -0.211617  0.496304
3  Kxu5UHgjKC       NaN  0.431297 -0.323424 -1.634375
4  SDeZJuTqgv  0.370362 -1.297056  1.569066 -0.067658

In [338]:
df_backup = df.copy(deep=True)

In [339]:
# Menghapus (drop) setiap kolom yang mengandung missing values
df = df.dropna(axis='columns')
df.head()

            Z
0  UafXORfsNo
1  XekafS6fTR
2  HdGZpUCGJU
3  Kxu5UHgjKC
4  SDeZJuTqgv

In [340]:
# Menghapus (drop) setiap baris yang mengandung missing values
df = df_backup.copy(deep=True)
df = df.dropna(axis='rows')
df.head()

            Z         A         B         C         D
0  UafXORfsNo -1.507542 -0.007271 -0.866165  1.822973
2  HdGZpUCGJU -1.287679  1.685643 -0.211617  0.496304
4  SDeZJuTqgv  0.370362 -1.297056  1.569066 -0.067658
5  DvHv4284ky -1.247742  1.467521  1.204308 -0.862618
6  HfWn3cQgpl  0.268620  0.402247 -1.377135  0.848072

In [341]:
# Persentase missing values untuk tiap kolom
df = df_backup.copy(deep=True)
df.isna().mean()

Z    0.000000
A    0.100000
B    0.133333
C    0.066667
D    0.100000
dtype: float64

In [342]:
# Menghapus (drop) setiap kolom yang mengandung missing values berdasarkan treshold / ambang batas (presentase missing value)
treshold = len(df)*0.9
df = df.dropna(thresh=treshold, axis='columns')
df.head()

            Z         A         C         D
0  UafXORfsNo -1.507542 -0.866165  1.822973
1  XekafS6fTR -0.256574 -0.084703 -0.265507
2  HdGZpUCGJU -1.287679 -0.211617  0.496304
3  Kxu5UHgjKC       NaN -0.323424 -1.634375
4  SDeZJuTqgv  0.370362  1.569066 -0.067658

## #08: Memeriksa kesamaan antar kolom (series) pada data frame

In [343]:
# Persiapan data frame
data  = {'A':[15, 15, 18, np.nan, 12],'B':[15, 15, 18, np.nan, 12]}
df = pd.DataFrame(data)
df

      A     B
0  15.0  15.0
1  15.0  15.0
2  18.0  18.0
3   NaN   NaN
4  12.0  12.0

In [344]:
# Mengenal pandas series
# data frame merupakan kumpulan dari data series
df['A']

0    15.0
1    15.0
2    18.0
3     NaN
4    12.0
Name: A, dtype: float64

In [345]:
type(df['A'])

pandas.core.series.Series

In [346]:
type(df)

pandas.core.frame.DataFrame

In [347]:
# Memeriksa kesamaan dengan operator == (Tidak di rekomendasikan karena apabila dalam data teradap NaN maka akan tidak terbaca dengan baik)
df['A'] == df['B']

0     True
1     True
2     True
3    False
4     True
dtype: bool

In [348]:
# Memeriksa kesamaan dengan method equals() | Lebih di rekomendasikan
df['A'].equals(df['B'])

True

In [349]:
# Memeriksa kesamaan antar dua data frame
df1 = df.copy(deep=True)
df.equals(df1)

True

In [350]:
df == df1

       A      B
0   True   True
1   True   True
2   True   True
3  False  False
4   True   True

## #09: Membagi data frame menjadi dua secara acak

In [351]:
# Persiapan data frame
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows, n_cols)), columns=cols)
df

    A   B   C   D   E
0  10   9  14  16  15
1   3   2   5  18   7
2   8   8   4   9   7
3  12  15   8   6  15
4  19   6   2  13  19
5   5   5  13  17   8
6   1  12   6  13  15
7   5  13  18   9  11
8  11   4   6   6  18
9  13  16   4  11   3

In [352]:
# Membagi dua data frame menjadi dua secara acak berdasarkan proporsi tertentu
df.shape

(10, 5)

In [353]:
proporsi = 0.7
df_1 = df.sample(frac=proporsi)
df_2 = df.drop(df_1.index)

print(f'df_1 Shape: {df_1.shape}')
print(f'df_2 Shape: {df_2.shape}')

df_1 Shape: (7, 5)
df_2 Shape: (3, 5)

In [354]:
df_1

    A   B   C   D   E
7   5  13  18   9  11
9  13  16   4  11   3
0  10   9  14  16  15
3  12  15   8   6  15
4  19   6   2  13  19
6   1  12   6  13  15
2   8   8   4   9   7

In [355]:
df_2

    A  B   C   D   E
1   3  2   5  18   7
5   5  5  13  17   8
8  11  4   6   6  18

## #10: Mengganti nama (label) kolom pada data frame berdasarkan pola

In [356]:
# Persiapan data frame
df = pd.read_csv('./Dataset/titanicfull.csv')
df.columns = ['Pclass','Survival status','full Name','Sex ',' Age','Sib SP', 'parch','Ticket','Fare','Cabin','Embarked']
df_backup = df.copy(deep=True)
df.head()

,Pclass,Survival status,full Name,Sex,Age,Sib SP,parch,Ticket,Fare,Cabin,Embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

In [357]:
# Menggunakan lowercase untuk nama kolom dan mengganti spasi dengan _
df.columns = df.columns.str.replace(' ','_').str.lower()
df.head()

,pclass,survival_status,full_name,sex_,_age,sib_sp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

In [358]:
# Memangkas kelebihan spasi pada nama kolom
df = df_backup.copy(deep=True)
df.columns = df.columns.str.lower().str.strip().str.replace(' ','_') 
# Remark:
# str.lower() = merubah menjadi huruf kecil
# str.strip() = menghilangkan kelebihan sepasi di awal ataupun diakhir kata
# str.replace() = mengganti huruf
df.head()

,pclass,survival_status,full_name,sex,age,sib_sp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

## #11: Seleksi kolom dan baris pada data frame menggunakan loc

In [359]:
# Persiapan data frame
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows, n_cols)), columns=cols)
df

    A   B   C   D   E
0   2  16  14  18   6
1  12  11  13  10  11
2   9  19  14  17   6
3  13  14  19  19   6
4   3   4   3   3  19
5   4   7  11   8  18
6   9  19  17  13  15
7   7  12   1   5  10
8  12   3  16  18   5
9   8   3   5   9   5

In [360]:
# Seleksi kolom dan baris menggunakan loc
df.loc[[0,3,4],['B','E']] #bagian pertama untuk baris, bagian kedua untuk kolom

    B   E
0  16   6
3  14   6
4   4  19